; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v11 ?v10)
             (pred_4 ?v3 ?v2)
             (pred_3 ?v11 ?v2)
             (pred_12 ?v6 ?v11 )
	     (pred_7 ?v11)
             (pred_6 ?v7)
             (pred_11 ?v3)
             (pred_9 ?v2)
             (pred_10 ?v11)
             (pred_1 ?v3)
             (pred_8 ?v11)
             (pred_2 ))



(:action op_3
:parameters (?v12 ?v9 ?v5 ?v13)
:precondition (and (pred_6 ?v12) (pred_6 ?v9) (pred_11 ?v5) (pred_9 ?v13)
          (pred_5 ?v12 ?v9) (pred_4 ?v5 ?v13)
                   (pred_3 ?v9 ?v13) (pred_7 ?v12) 
                   (pred_10 ?v9) (pred_1 ?v5))
:effect (and  (pred_8 ?v9) (not (pred_10 ?v9))))


(:action op_4
:parameters (?v12 ?v8)
:precondition (and (pred_6 ?v12) (pred_6 ?v8)
               (pred_7 ?v12) (pred_5 ?v12 ?v8) (pred_8 ?v8))
:effect (and (pred_7 ?v8) (not (pred_7 ?v12))))

(:action op_5
:parameters (?v12 ?v5)
:precondition (and (pred_6 ?v12) (pred_11 ?v5) 
                  (pred_7 ?v12) (pred_12 ?v5 ?v12) (pred_2 ))
:effect (and (pred_1 ?v5)
   (not (pred_12 ?v5 ?v12)) (not (pred_2 ))))


(:action op_2
:parameters (?v12 ?v1 ?v4)
:precondition (and (pred_6 ?v12) (pred_11 ?v1) (pred_11 ?v4)
                  (pred_7 ?v12) (pred_1 ?v4) (pred_12 ?v1 ?v12))
:effect (and (pred_1 ?v1) (pred_12 ?v4 ?v12)
        (not (pred_1 ?v4)) (not (pred_12 ?v1 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_6 ?v12) (pred_11 ?v5) 
                  (pred_7 ?v12) (pred_1 ?v5))
:effect (and (pred_2 ) (pred_12 ?v5 ?v12) (not (pred_1 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_08 obj_01 obj_12 obj_02 obj_11 obj_15 obj_21 obj_16 obj_20 obj_03 obj_18 obj_25 obj_23 obj_07 obj_26 obj_22 obj_10 obj_24 obj_14 obj_04 obj_29 obj_27 obj_13 obj_09
    obj_28 obj_19
    obj_05 obj_30 obj_17
    )

    (:init
       (pred_2)

       (pred_6 obj_06)
       (pred_6 obj_08)
       (pred_6 obj_01)
       (pred_6 obj_12)
       (pred_6 obj_02)
       (pred_6 obj_11)
       (pred_6 obj_15)
       (pred_6 obj_21)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_03)
       (pred_6 obj_18)
       (pred_6 obj_25)
       (pred_6 obj_23)
       (pred_6 obj_07)
       (pred_6 obj_26)
       (pred_6 obj_22)
       (pred_6 obj_10)
       (pred_6 obj_24)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_29)
       (pred_6 obj_27)
       (pred_6 obj_13)
       (pred_6 obj_09)
       (pred_9 obj_28)
       (pred_9 obj_19)
       (pred_11 obj_05)
       (pred_11 obj_30)
       (pred_11 obj_17)

       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_08 obj_15)
       (pred_5 obj_08 obj_01)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_01 obj_08)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_11 obj_03)
       (pred_5 obj_11 obj_15)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_15 obj_08)
       (pred_5 obj_15 obj_11)
       (pred_5 obj_21 obj_25)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_16 obj_23)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_20 obj_07)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_03 obj_26)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_18 obj_22)
       (pred_5 obj_18 obj_25)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_25 obj_10)
       (pred_5 obj_25 obj_23)
       (pred_5 obj_25 obj_21)
       (pred_5 obj_25 obj_18)
       (pred_5 obj_23 obj_24)
       (pred_5 obj_23 obj_07)
       (pred_5 obj_23 obj_16)
       (pred_5 obj_23 obj_25)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_07 obj_20)
       (pred_5 obj_07 obj_23)
       (pred_5 obj_26 obj_04)
       (pred_5 obj_26 obj_22)
       (pred_5 obj_26 obj_03)
       (pred_5 obj_22 obj_29)
       (pred_5 obj_22 obj_10)
       (pred_5 obj_22 obj_18)
       (pred_5 obj_22 obj_26)
       (pred_5 obj_10 obj_27)
       (pred_5 obj_10 obj_24)
       (pred_5 obj_10 obj_25)
       (pred_5 obj_10 obj_22)
       (pred_5 obj_24 obj_13)
       (pred_5 obj_24 obj_14)
       (pred_5 obj_24 obj_23)
       (pred_5 obj_24 obj_10)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_14 obj_24)
       (pred_5 obj_04 obj_29)
       (pred_5 obj_04 obj_26)
       (pred_5 obj_29 obj_27)
       (pred_5 obj_29 obj_22)
       (pred_5 obj_29 obj_04)
       (pred_5 obj_27 obj_13)
       (pred_5 obj_27 obj_10)
       (pred_5 obj_27 obj_29)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_13 obj_24)
       (pred_5 obj_13 obj_27)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_09 obj_13)
       (pred_10 obj_14)
       (pred_10 obj_12)
       (pred_10 obj_26)
       (pred_3  obj_14 obj_28)
       (pred_3  obj_12 obj_19)
       (pred_3  obj_26 obj_19)
       (pred_8 obj_06)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_8 obj_02)
       (pred_8 obj_11)
       (pred_8 obj_15)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_20)
       (pred_8 obj_03)
       (pred_8 obj_18)
       (pred_8 obj_25)
       (pred_8 obj_23)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_10)
       (pred_8 obj_24)
       (pred_8 obj_04)
       (pred_8 obj_29)
       (pred_8 obj_27)
       (pred_8 obj_13)
       (pred_8 obj_09)

       (pred_4  obj_05 obj_28)
       (pred_4  obj_30 obj_19)
       (pred_4  obj_17 obj_19)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_30 obj_02)
       (pred_12 obj_17 obj_01)
       (pred_7 obj_16)
    )

    (:goal (and
       (pred_12 obj_05 obj_10)
       (pred_12 obj_30 obj_24)
       (pred_12 obj_17 obj_08)
    ))
(:constraints
  (always (not (pred_7 obj_23)))
)
)

; plan
1. (op_4 obj_16 obj_20)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_20)
   goals met: 0 of 3
2. (op_4 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 0 of 3
3. (op_5 obj_02 obj_05)
   deleted: (pred_12 obj_05 obj_02) (pred_2)
   added: (pred_1 obj_05)
   goals met: 0 of 3
4. (op_4 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 0 of 3
5. (op_4 obj_20 obj_16)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_16)
   goals met: 0 of 3
6. (op_4 obj_16 obj_21)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_21)
   goals met: 0 of 3
7. (op_4 obj_21 obj_01)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_01)
   goals met: 0 of 3
8. (op_4 obj_01 obj_08)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_08)
   goals met: 0 of 3
9. (op_1 obj_08 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_2) (pred_12 obj_05 obj_08)
   goals met: 0 of 3
10. (op_4 obj_08 obj_01)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_01)
   goals met: 0 of 3
11. (op_5 obj_01 obj_17)
   deleted: (pred_12 obj_17 obj_01) (pred_2)
   added: (pred_1 obj_17)
   goals met: 0 of 3
12. (op_3 obj_01 obj_12 obj_17 obj_19)
   deleted: (pred_10 obj_12)
   added: (pred_8 obj_12)
   goals met: 0 of 3
13. (op_4 obj_01 obj_08)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_08)
   goals met: 0 of 3
14. (op_2 obj_08 obj_05 obj_17)
   deleted: (pred_1 obj_17) (pred_12 obj_05 obj_08)
   added: (pred_1 obj_05) (pred_12 obj_17 obj_08)
   goals met: 1 of 3
15. (op_4 obj_08 obj_01)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_01)
   goals met: 1 of 3
16. (op_4 obj_01 obj_12)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_12)
   goals met: 1 of 3
17. (op_4 obj_12 obj_02)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_02)
   goals met: 1 of 3
18. (op_4 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 1 of 3
19. (op_4 obj_20 obj_07)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_07)
   goals met: 1 of 3
20. (op_3 obj_07 obj_14 obj_05 obj_28)
   deleted: (pred_10 obj_14)
   added: (pred_8 obj_14)
   goals met: 1 of 3
21. (op_4 obj_07 obj_14)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_14)
   goals met: 1 of 3
22. (op_4 obj_14 obj_24)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_24)
   goals met: 1 of 3
23. (op_4 obj_24 obj_10)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_10)
   goals met: 1 of 3
24. (op_1 obj_10 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_2) (pred_12 obj_05 obj_10)
   goals met: 2 of 3
25. (op_4 obj_10 obj_24)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_24)
   goals met: 2 of 3
26. (op_4 obj_24 obj_14)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_14)
   goals met: 2 of 3
27. (op_4 obj_14 obj_07)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_07)
   goals met: 2 of 3
28. (op_4 obj_07 obj_20)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_20)
   goals met: 2 of 3
29. (op_4 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 2 of 3
30. (op_5 obj_02 obj_30)
   deleted: (pred_12 obj_30 obj_02) (pred_2)
   added: (pred_1 obj_30)
   goals met: 2 of 3
31. (op_4 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 2 of 3
32. (op_4 obj_20 obj_07)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_07)
   goals met: 2 of 3
33. (op_4 obj_07 obj_14)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_14)
   goals met: 2 of 3
34. (op_4 obj_14 obj_24)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_24)
   goals met: 2 of 3
35. (op_1 obj_24 obj_30)
   deleted: (pred_1 obj_30)
   added: (pred_2) (pred_12 obj_30 obj_24)
   goals met: 3 of 3
